src/main/xmlfiles/requests/getAantalParkeerplaatsen.request.soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:get="http://parkeerplaatsservice/berichten/getaantallenrequest">
   <soapenv:Header/>
   <soapenv:Body>
      <get:getaantallen>
      </get:getaantallen>
   </soapenv:Body>
</soapenv:Envelope>